app/controllers/articles_controller.rb

SELECT * FROM `articles` WHERE (`articles`.`id` = 5)
UPDATE `articles` SET `updated_at` = '2011-02-18 09:36:41', `position` = 2 WHERE `id` = 5
---
  def sort
    @articles_array = params[:article].to_a
    @articles_array.each_with_index do |a,index|
      @article = Article.find(a.to_i)
      @article.update_attributes!(:position => index+1)

SELECT * FROM `articles` WHERE (1 = 1 AND position = 2) LIMIT 1
---
  def down
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (1 = 1 AND position = 0) LIMIT 1
---
  def up
    @article = Article.find(params[:id])

SELECT * FROM `articles` ORDER BY position_id
---
  def index
    @articles = Article.all(:order => "position")

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def show
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`name`, `created_at`, `updated_at`, `position_id`) VALUES('Latest', '2011-03-22 07:07:04', '2011-03-22 07:07:04', NULL)
---
  def create
    @article = Article.new(params[:article])
    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 7)
---
  def update
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 3)
DELETE FROM `articles` WHERE `id` = 3
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy